---
kind: property
id: P:Autodesk.Revit.DB.SunAndShadowSettings.TimeZone
source: html/aa185d98-d4a2-58f5-0a45-8e8eac070f5a.htm
---
# Autodesk.Revit.DB.SunAndShadowSettings.TimeZone Property

Identifies the time zone.

## Syntax (C#)
```csharp
public double TimeZone { get; }
```

## Remarks
Identifies the time zone used by the SunAndShadowSettings element.
 This property indicates the time zone in which the site resides.
 The value is in hours, ranging from +12 hours to -12 hours with 0 being GMT.